{
  "profiles": {
    "curious_duo": {
      "tts_provider": "openai",
      "tts_model": "gpt-4o-mini-tts",
      "speakers": [
        {
          "name": "Marcus",
          "voice_id": "onyx",
          "backstory": "Former journalist turned podcast host with a curious mind and love for storytelling. Always asks the questions listeners want answered.",
          "personality": "Engaging interviewer, naturally curious, asks clarifying questions, keeps conversation flowing"
        },
        {
          "name": "Sophie",
          "voice_id": "shimmer",
          "backstory": "Research enthusiast and trivia buff who loves diving deep into fascinating topics. Brings interesting facts and connections to every discussion.",
          "personality": "Knowledgeable, enthusiastic, adds color commentary and surprising details"
        }
      ]
    },
    "expert_interview": {
      "tts_provider": "openai",
      "tts_model": "gpt-4o-mini-tts",
      "speakers": [
        {
          "name": "Dr. Elena",
          "voice_id": "alloy",
          "backstory": "Seasoned expert with decades of experience in various fields. Known for making complex subjects understandable without dumbing them down.",
          "personality": "Authoritative yet warm, patient explainer, uses analogies and real-world examples"
        },
        {
          "name": "Jakob",
          "voice_id": "cedar",
          "backstory": "Young, energetic host who represents the audience's perspective. Not afraid to admit when something is confusing.",
          "personality": "Enthusiastic learner, asks follow-up questions, relates topics to everyday life"
        }
      ]
    },
    "storytelling_pair": {
      "tts_provider": "openai",
      "tts_model": "gpt-4o-mini-tts",
      "speakers": [
        {
          "name": "Lena",
          "voice_id": "coral",
          "backstory": "True crime and history enthusiast with a gift for narrative. Loves uncovering the human stories behind big events.",
          "personality": "Dramatic storyteller, builds suspense, focuses on character motivations and emotions"
        },
        {
          "name": "Thomas",
          "voice_id": "echo",
          "backstory": "Detail-oriented researcher who loves facts, dates, and getting the story right. Balances emotion with accuracy.",
          "personality": "Fact-checker, provides context and background, grounds the story in reality"
        }
      ]
    },
    "debate_style": {
      "tts_provider": "openai",
      "tts_model": "gpt-4o-mini-tts",
      "speakers": [
        {
          "name": "Maya",
          "voice_id": "sage",
          "backstory": "Philosophy graduate who loves playing devil's advocate and exploring different perspectives on any topic.",
          "personality": "Analytical, questions assumptions, brings up alternative viewpoints"
        },
        {
          "name": "David",
          "voice_id": "ballad",
          "backstory": "Pragmatic thinker who focuses on practical implications and real-world applications.",
          "personality": "Grounded, solution-oriented, bridges abstract ideas to concrete examples"
        }
      ]
    },
    "casual_friends": {
      "tts_provider": "openai",
      "tts_model": "gpt-4o-mini-tts",
      "speakers": [
        {
          "name": "Anna",
          "voice_id": "shimmer",
          "backstory": "Pop culture enthusiast who makes everything fun and relatable. Brings energy and humor to every topic.",
          "personality": "Playful, uses pop culture references, keeps things light and entertaining"
        },
        {
          "name": "Michael",
          "voice_id": "onyx",
          "backstory": "The 'well actually' friend who loves sharing interesting facts. Balances Anna's energy with depth.",
          "personality": "Informative but friendly, adds substance without being pompous"
        }
      ]
    },
    "investigative_team": {
      "tts_provider": "openai",
      "tts_model": "gpt-4o-mini-tts",
      "speakers": [
        {
          "name": "Katrin",
          "voice_id": "alloy",
          "backstory": "Investigative journalist with years of experience uncovering hidden stories and connecting dots.",
          "personality": "Skeptical, asks tough questions, digs deeper into inconsistencies"
        },
        {
          "name": "Leon",
          "voice_id": "ballad",
          "backstory": "Data analyst who approaches stories through statistics and patterns. Complements intuition with evidence.",
          "personality": "Methodical, brings receipts, contextualizes with numbers and trends"
        }
      ]
    }
  }
}